nxp-imx-support/imx8ulp-cm33-usecase/boards/evkmimx8ulp/demo_apps/power_mode_switch/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMicPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: A9, peripheral: MICFIL0, signal: 'micfil_clk, 01', pin_signal: PTB0}
  - {pin_num: B10, peripheral: MICFIL0, signal: 'micfil_data, 01', pin_signal: PTB1, PS: UP, PE: ENABLED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitMicPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitMicPins(void) {                             /*!< Function assigned for the core: Cortex-M33[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PTB0_MICFIL0_CLK01, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTB1_MICFIL0_DATA01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PTB1_MICFIL0_DATA01,
                        IOMUXC_PCR_PE_MASK |
                        IOMUXC_PCR_PS_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSpeakerPins:
- options: {callFromInitBoot: 'true', coreID: cm33}
- pin_list:
  - {pin_num: A7, peripheral: MQS0, signal: mqs_left, pin_signal: PTA22}
  - {pin_num: D8, peripheral: MQS0, signal: mqs_right, pin_signal: PTA21}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSpeakerPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSpeakerPins(void) {                         /*!< Function assigned for the core: Cortex-M33[cm33] */
#ifdef FOR_X8ULPWATCHREF
    IOMUXC_SetPinMux(IOMUXC_PTC0_MQS0_LEFT, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTC1_MQS0_RIGHT, 0U);
#else
    IOMUXC_SetPinMux(IOMUXC_PTA21_MQS0_RIGHT, 0U);
    IOMUXC_SetPinMux(IOMUXC_PTA22_MQS0_LEFT, 0U);
#endif
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
